import Icon from '@ant-design/icons';
import type { CustomIconComponentProps } from '@ant-design/icons/lib/components/Icon';

export const Svg = () => (
  <svg xmlns='http://www.w3.org/2000/svg' viewBox='0 0 13.19 14.14' fill='#fff' width='1em' height='1em'>
    <g id='图层_2' data-name='图层 2'>
      <g id='图层_1-2' data-name='图层 1'>
        <path className='cls-1'
              d='M11.56,2a1.87,1.87,0,0,1,.8.16,1.45,1.45,0,0,1,.5.41,1.5,1.5,0,0,1,.26.52,2.58,2.58,0,0,1,.07.52c0,.08,0,.14,0,.18a.45.45,0,0,0,0,.11V4H12.11v8.46a1.69,1.69,0,0,1-.13.63,1.71,1.71,0,0,1-.37.52A1.83,1.83,0,0,1,11,14a2.2,2.2,0,0,1-.8.14H3A2.3,2.3,0,0,1,2.24,14a2.09,2.09,0,0,1-.64-.36,2,2,0,0,1-.42-.57A1.79,1.79,0,0,1,1,12.33V4H0S0,4,0,4a3.84,3.84,0,0,1,0-.5A1.24,1.24,0,0,1,.1,3a1.36,1.36,0,0,1,.29-.47,1.48,1.48,0,0,1,.5-.37A1.74,1.74,0,0,1,1.61,2H3.05V1A1,1,0,0,1,3.34.3.94.94,0,0,1,4.05,0h5a.89.89,0,0,1,.78.3,1.16,1.16,0,0,1,.22.72V2h1.47ZM4.05,2h5V1h-5Zm-.5,10.21q.51,0,.51-.66V4.09h-1v7.49a1,1,0,0,0,.11.5.43.43,0,0,0,.38.16Zm3,0A.39.39,0,0,0,7,12.07a.9.9,0,0,0,.1-.49V4.09h-1v7.49c0,.43.18.64.53.64Zm3,0c.2,0,.33,0,.39-.16a.87.87,0,0,0,.1-.49V4.09h-1v7.45c0,.43.18.65.53.65Z'/>
      </g>
    </g>
  </svg>
);

const WasteGeneralIcon = (props: Partial<CustomIconComponentProps>) => <Icon component={ Svg } { ...props } />;
export default WasteGeneralIcon
